In [1]:
!pip install pandas
!pip install numpy

Collecting pandas
  Downloading pandas-2.3.0-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in d:\data_science\.venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\data_science\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in d:\data_science\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.0-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.0 MB 6.7 MB/s eta 0:00:02
   ----------- ---------------------------- 3.1/11.0 MB 9.7 MB/s eta 0:00:01
   --------------------- ------------------ 5.8/11.0 MB 10.7 MB/s eta 0:00:01
   ----------------------------- ---------- 8.1/11.0 MB 11.0 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 11.1 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 10.7 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas

   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed pandas-2.3.0 pytz-2025.2 tzdata-2025.2
Requirement already satisfied: numpy in d:\data_science\.venv\lib\site-packages (2.2.6)

In [2]:
import pandas as pd

In [4]:
## series 
data = [1,2,3,4,5]
series = pd.Series(data)
print("series \n ",series )
print(type(series))

series
  0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
## creation of series from dictionary
data = {'a':1,'b':2,'c':3,'d':4,'e':5}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
data = [10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [8]:
## dataframe
## create a dataframe from dictionary of list

data = {
    'name': ['Keshav','Anchal','Rohit','bansal','Ashutosh'],
    'Age': [20,19,21,21,21],
    'City':['New Delhi','Delhi','Patna','Dilli','U P']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

       name  Age       City
0    Keshav   20  New Delhi
1    Anchal   19      Delhi
2     Rohit   21      Patna
3    bansal   21      Dilli
4  Ashutosh   21        U P
<class 'pandas.core.frame.DataFrame'>

In [9]:
import numpy as np
np.array(df)

array([['Keshav', 20, 'New Delhi'],
       ['Anchal', 19, 'Delhi'],
       ['Rohit', 21, 'Patna'],
       ['bansal', 21, 'Dilli'],
       ['Ashutosh', 21, 'U P']], dtype=object)

In [17]:
## create data frame from list of dict
data = [
    {'Name':'Keshav','Age':20,'City':'New Delhi'},
    {'Name':'Anchal','Age':19,'City':'New Delhi'},
    {'Name':'Rohit','Age':21,'City':'New Delhi'},
    {'Name':'Bansal','Age':21,'City':'New Delhi'}
]
df= pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Keshav   20  New Delhi
1  Anchal   19  New Delhi
2   Rohit   21  New Delhi
3  Bansal   21  New Delhi
<class 'pandas.core.frame.DataFrame'>

In [52]:
df=pd.read_csv('Sales_data.csv')
print(df.head(5))

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [53]:
print(df.tail(5))

     Transaction ID        Date Product Category  \
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

In [54]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [22]:
### Acessing data from df 
df['Name']

0    Keshav
1    Anchal
2     Rohit
3    Bansal
Name: Name, dtype: object

In [30]:
df.loc[0]

Name       Keshav
Age            20
City    New Delhi
Name: 0, dtype: object

In [29]:
df.iloc[0]

Name       Keshav
Age            20
City    New Delhi
Name: 0, dtype: object

In [33]:
## Accessing specified element
df.at[1,'Age']

np.int64(19)

In [ ]:
### Acessing the specified element by iat
df.iat[2,2]

'New Delhi'

In [36]:
### data manipulation with dataframes
df

     Name  Age       City
0  Keshav   20  New Delhi
1  Anchal   19  New Delhi
2   Rohit   21  New Delhi
3  Bansal   21  New Delhi

In [37]:
## add a new col "salary"
df['Salary']=[100000,100000,100000,100000]
df

     Name  Age       City  Salary
0  Keshav   20  New Delhi  100000
1  Anchal   19  New Delhi  100000
2   Rohit   21  New Delhi  100000
3  Bansal   21  New Delhi  100000

In [42]:
## remove the col
df.drop('Salary',axis=1,inplace = True)

In [43]:
df

     Name  Age       City
0  Keshav   20  New Delhi
1  Anchal   19  New Delhi
2   Rohit   21  New Delhi
3  Bansal   21  New Delhi

In [44]:
## add age to col
df['Age']=df['Age']+1

In [45]:
df

     Name  Age       City
0  Keshav   21  New Delhi
1  Anchal   20  New Delhi
2   Rohit   22  New Delhi
3  Bansal   22  New Delhi

In [50]:
df.drop(1,inplace=True)

In [51]:
df

     Name  Age       City
2   Rohit   22  New Delhi
3  Bansal   22  New Delhi